# 데이터 삽입하기

## INSERT 

INSERT INTO <table name>() VALUES();
    
```mysql
INSERT INTO cats(name, age)
VALUES ('Jetson', 7);

INSERT INTO cats(name, age) VALUES ('Jetson', 7);

INSERT INTO cats(
            name, 
            age)
VALUES     ("Jetson",
            7);
```

column 이름을 쓰는 순서도 중요하다. 이후에도 잘 지켜야 하기 때문이다.

코드: 데이터 삽입하기
-- Re-create the cats table (I dropped it in a previous video)


```sql
CREATE TABLE cats (
    name VARCHAR(50),
    age INT
);

Insert a cat:

INSERT INTO cats (name, age) 
VALUES ('Blue Steele', 5);
And another:

INSERT INTO cats (name, age) 
VALUES ('Jenkins', 7);

```

## SELECT 초스피드 간단 소개

SELECT * FROM cats; # cats 테이블에서 모두를 보여준다.

## 다중 INSERT 

```mysql
INSERT INTO cats (name, age)
VALUES ()

```

ㅇ-- Single insert (switching order of name and age)
```sql
INSERT INTO cats (age, name) 
VALUES 
  (2, 'Beth');
```
  
-- Multiple Insert:
```mysql
INSERT INTO cats (name, age) 
VALUES 
  ('Meatball', 5), 
  ('Turkey', 1), 
  ('Potato Face', 15);
```

## INSERT 도전과제 풀이

데이터베이스 선택 : USE cat_app;
현재 데이터베이스 확인 : SELECT DATABASE();

1. 테이블 생성 : first_name VARCHAR(20), last_name VARCHAR(20), age INT)
```mysql
CREATE TABLE people(
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    age INT
    );
    
INSERT INTO people (first_name, last_name, age)
VALUES ('Tina', 'Belcher', 13);

INSERT INTO people(age, last_name, first_name)
VALUES (42, 'Belcher', 'Bob');


INSERT INTO people(first_name, last_name, age)
VALUES
    ('Linda', 'Belcher', 45),
    ('Phillip', 'Frond', 38),
    ('Calvin', 'Fischoeder', 70);
    
-- 테이블 삭제
DROP TABLE people;

-- 테이블 삭제 확인(error 출력)
SELECT * FROM people;

-- SHOW TABLES;
SHOW TABLES;

```

## NULL과  NOT_NULL

> NULL : 미확인 값이나 아직 적용되지 않은 값(Value is Not known,)  
0값 조차도 존재하지 않는 개체의 빈 특성

NULL
YES
- 알려지지 않은 값이 있어도 괜찮다는 의미.

NOT NULL : 테이블을 정의할 때 지정할 수 있다.
예를 들어 name과 같은 필드가 NOT NULL이라고 지정하고 싶다면

Using NOT NULL:
```mysql
CREATE TABLE cats2 (
    name VARCHAR(100) NOT NULL,
    age INT NOT NULL
);
```
테스트

INSERT INTO cats2(name) VALUES('Texas');

## 기본값 설정하기 36

```mysql
CREATE TABLE cats3 (
    name VARCHAR(20) DEFAULT 'no name provided',
    age INT DEFAULT 99
);

INSERT INTO cats3(age) VALUES(13);

INSERT INTO cats3() VALUES();

CREATE TABLE cats4 (
    name VARCHAR(20) NOT NULL DEFAULT 'unnamed',
    age INT NOT NULL DEFAULT 99
);

```

## 기본키(Primary key) 입문

속성값이 같아도 각기 다른 인스턴스인 경우

Primary key : 유니크한 식별 자